In [1]:
import pandas as pd

In [65]:
df = pd.read_excel(r"C:\Users\Croma Campus\Downloads\Financial_Sample.xlsx")

In [4]:
df.shape

(700, 16)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 16 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Segment              692 non-null    object
 1   Country              689 non-null    object
 2   Product              692 non-null    object
 3   Discount Band        638 non-null    object
 4   Units Sold           695 non-null    float64
 5   Manufacturing Price  700 non-null    int64
 6   Sale Price           693 non-null    float64
 7   Gross Sales          695 non-null    float64
 8   Discounts            695 non-null    float64
 9    Sales               700 non-null    float64
 10  COGS                 700 non-null    float64
 11  Profit               700 non-null    float64
 12  Date                 700 non-null    datetime64[ns]
 13  Month Number         700 non-null    int64
 14  Month Name           700 non-null    object
 15  Year                 700 non-null    int64
dtypes: datetime64[ns](1), float64(7), int64(3), object(5)
memory usage: 87.6+ KB

In [6]:
df.describe()

,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Year
count,695.000000,700.000000,693.000000,6.950000e+02,695.000000,7.000000e+02,700.000000,700.000000,700,700.000000,700.000000
mean,1607.880576,96.477143,117.914863,1.839670e+05,13077.162345,1.696091e+05,145475.211429,24133.860371,2014-04-28 21:36:00,7.900000,2013.750000
min,200.000000,3.000000,7.000000,1.799000e+03,0.000000,1.655080e+03,918.000000,-40617.500000,2013-09-01 00:00:00,1.000000,2013.000000
25%,906.500000,5.000000,12.000000,1.760250e+04,799.640000,1.592800e+04,7490.000000,2805.960000,2013-12-24 06:00:00,5.750000,2013.750000
50%,1540.000000,10.000000,20.000000,3.838500e+04,2567.600000,3.554020e+04,22506.250000,9242.200000,2014-05-16 12:00:00,9.000000,2014.000000
75%,2224.750000,250.000000,300.000000,2.859500e+05,15333.500000,2.610775e+05,245607.500000,22662.000000,2014-09-08 12:00:00,10.250000,2014.000000
max,4492.500000,260.000000,350.000000,1.207500e+06,149677.500000,1.159200e+06,950625.000000,262200.000000,2014-12-01 00:00:00,12.000000,2014.000000
std,867.307497,108.602612,136.571680,2.547749e+05,22993.148986,2.367263e+05,203865.506118,42760.626563,NaN,3.377321,0.433322

In [9]:
df.head()

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,NaN,1618.5,3,20.0,32370.0,0.0,32370.0,16185.0,16185.0,2014-01-01,1,January,2014
1,Government,Germany,Carretera,NaN,1321.0,3,20.0,26420.0,0.0,26420.0,13210.0,13210.0,2014-01-01,1,January,2014
2,Midmarket,France,Carretera,NaN,2178.0,3,15.0,32670.0,0.0,32670.0,21780.0,10890.0,2014-06-01,6,June,2014
3,Midmarket,Germany,Carretera,NaN,888.0,3,15.0,13320.0,0.0,13320.0,8880.0,4440.0,2014-06-01,6,June,2014
4,Midmarket,Mexico,Carretera,NaN,2470.0,3,15.0,37050.0,0.0,37050.0,24700.0,12350.0,2014-06-01,6,June,2014

In [10]:
df.head(2)

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,NaN,1618.5,3,20.0,32370.0,0.0,32370.0,16185.0,16185.0,2014-01-01,1,January,2014
1,Government,Germany,Carretera,NaN,1321.0,3,20.0,26420.0,0.0,26420.0,13210.0,13210.0,2014-01-01,1,January,2014

In [11]:
df.tail()

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
695,Small Business,France,Amarilla,High,2475.0,260,300.0,742500.0,111375.00,631125.00,618750.0,12375.00,2014-03-01,3,March,2014
696,Small Business,Mexico,Amarilla,High,546.0,260,300.0,163800.0,24570.00,139230.00,136500.0,2730.00,2014-10-01,10,October,2014
697,Government,Mexico,Montana,High,1368.0,5,7.0,9576.0,1436.40,8139.60,6840.0,1299.60,2014-02-01,2,February,2014
698,Government,Canada,Paseo,High,723.0,10,7.0,5061.0,759.15,4301.85,3615.0,686.85,2014-04-01,4,April,2014
699,Channel Partners,United States of America,VTT,High,1806.0,250,12.0,21672.0,3250.80,18421.20,5418.0,13003.20,2014-05-01,5,May,2014

In [13]:
df.tail(3)

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
697,Government,Mexico,Montana,High,1368.0,5,7.0,9576.0,1436.40,8139.60,6840.0,1299.60,2014-02-01,2,February,2014
698,Government,Canada,Paseo,High,723.0,10,7.0,5061.0,759.15,4301.85,3615.0,686.85,2014-04-01,4,April,2014
699,Channel Partners,United States of America,VTT,High,1806.0,250,12.0,21672.0,3250.80,18421.20,5418.0,13003.20,2014-05-01,5,May,2014

In [14]:
df.Segment

0            Government
1            Government
2             Midmarket
3             Midmarket
4             Midmarket
             ...
695      Small Business
696      Small Business
697          Government
698          Government
699    Channel Partners
Name: Segment, Length: 700, dtype: object

In [15]:
df.Segment.value_counts()

Segment
Government          294
Midmarket           100
Enterprise          100
Small Business      100
Channel Partners     98
Name: count, dtype: int64

In [17]:
df.Segment.unique()

array(['Government', 'Midmarket', 'Channel Partners', 'Enterprise',
       'Small Business', nan], dtype=object)

In [18]:
print( df.Segment.unique() )

['Government' 'Midmarket' 'Channel Partners' 'Enterprise' 'Small Business'
 nan]

In [20]:
df.isnull().sum()

Segment                 8
Country                11
Product                 8
Discount Band          62
Units Sold              5
Manufacturing Price     0
Sale Price              7
Gross Sales             5
Discounts               5
 Sales                  0
COGS                    0
Profit                  0
Date                    0
Month Number            0
Month Name              0
Year                    0
dtype: int64

In [23]:
df.columns

Index(['Segment', 'Country', 'Product', 'Discount Band', 'Units Sold',
       'Manufacturing Price', 'Sale Price', 'Gross Sales', 'Discounts',
       ' Sales', 'COGS', 'Profit', 'Date', 'Month Number', 'Month Name',
       'Year'],
      dtype='object')

In [33]:
for col in df.columns:
    if df[col].isnull().sum()>0:
        print(col, "\t\tData Type :",df[col].dtype)

Segment 		Data Type : object
Country 		Data Type : object
Product 		Data Type : object
Discount Band 		Data Type : object
Units Sold 		Data Type : float64
Sale Price 		Data Type : float64
Gross Sales 		Data Type : float64
Discounts 		Data Type : float64

In [30]:
df[" Sales"].isnull().sum()

np.int64(0)

In [34]:
# lets fill all null values 
# object/string => replace null values by mode (most repeating value)

In [37]:
df.Segment.mode()[0]

'Government'

In [40]:
# numerical/float64 replace null values by mean (average)

In [41]:
df.Profit.mean()

np.float64(24133.860371428567)

In [46]:
df.Segment = df.Segment.fillna(value='Government')

In [47]:
df.Segment.isnull().sum()

np.int64(0)

In [54]:
# Print only object Column Names
df.select_dtypes(include="object").columns

Index(['Segment', 'Country', 'Product', 'Discount Band', 'Month Name'], dtype='object')

In [66]:
# Fill all Object null value with mode
for col in df.select_dtypes(include="object").columns:
    if df[col].isnull().sum()>0:
        print(col,"\t\tNull Values : ",df[col].isnull().sum(),"\t\tMode :",df[col].mode()[0])
        df[col] = df[col].fillna(value=df[col].mode()[0])

Segment 		Null Values :  8 		Mode : Government
Country 		Null Values :  11 		Mode : France
Product 		Null Values :  8 		Mode : Paseo
Discount Band 		Null Values :  62 		Mode : High

In [61]:
df.select_dtypes(include="object").isnull().sum()

Segment          0
Country          0
Product          0
Discount Band    0
Month Name       0
dtype: int64

In [71]:
for col in df.select_dtypes(include="float64").columns:
    if df[col].isnull().sum()>0:
        print(col,"\t\tNull :",df[col].isnull().sum(),"\t\tAverage :",df[col].mean())
        df[col] = df[col].fillna(value=df[col].mean())

Units Sold 		Null : 5 		Average : 1607.8805755395683
Sale Price 		Null : 7 		Average : 117.91486291486291
Gross Sales 		Null : 5 		Average : 183967.04244604317
Discounts 		Null : 5 		Average : 13077.16234532374

In [72]:
df.select_dtypes(include="float64").isnull().sum()

Units Sold     0
Sale Price     0
Gross Sales    0
Discounts      0
 Sales         0
COGS           0
Profit         0
dtype: int64

In [73]:
df.head(2)

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,High,1618.5,3,20.0,32370.0,0.0,32370.0,16185.0,16185.0,2014-01-01,1,January,2014
1,Government,Germany,Carretera,High,1321.0,3,20.0,26420.0,0.0,26420.0,13210.0,13210.0,2014-01-01,1,January,2014

In [74]:
# Pivot Table / Group by

In [79]:
pbs = df.groupby('Segment').agg({'Profit':'sum'}).reset_index()

In [80]:
pbs

            Segment        Profit
0  Channel Partners  1.290808e+06
1        Enterprise -6.145456e+05
2        Government  1.141417e+07
3         Midmarket  6.601031e+05
4    Small Business  4.143168e+06

In [84]:
sbc = df.groupby("Country").agg({" Sales":'sum'}).reset_index()

In [85]:
sbc

                    Country         Sales
0                    Canada  2.400017e+07
1                    France  2.711725e+07
2                   Germany  2.290578e+07
3                    Mexico  2.084595e+07
4  United States of America  2.385720e+07

In [88]:
pbcbs = df.groupby(["Country",'Segment']).agg({"Profit":'sum'}).reset_index()

In [89]:
pbcbs

                     Country           Segment       Profit
0                     Canada  Channel Partners   347633.940
1                     Canada        Enterprise  -121508.750
2                     Canada        Government  2176858.770
3                     Canada         Midmarket   132488.975
4                     Canada    Small Business   823965.000
5                     France  Channel Partners   309483.720
6                     France        Enterprise   -92131.875
7                     France        Government  3054235.560
8                     France         Midmarket   164542.075
9                     France    Small Business   861316.500
10                   Germany  Channel Partners   247358.880
11                   Germany        Enterprise  -103436.250
12                   Germany        Government  2676668.350
13                   Germany         Midmarket    85354.750
14                   Germany    Small Business   718222.000
15                    Mexico  Channel Partners   144840.000
16                    Mexico        Enterprise  -122333.750
17                    Mexico        Government  2048655.220
18                    Mexico         Midmarket   150546.400
19                    Mexico    Small Business   667606.000
20  United States of America  Channel Partners   241491.720
21  United States of America        Enterprise  -175135.000
22  United States of America        Government  1457750.150
23  United States of America         Midmarket   127170.875
24  United States of America    Small Business  1072059.000

In [90]:
sbc

                    Country         Sales
0                    Canada  2.400017e+07
1                    France  2.711725e+07
2                   Germany  2.290578e+07
3                    Mexico  2.084595e+07
4  United States of America  2.385720e+07

In [91]:
sbc.Country

0                      Canada
1                      France
2                     Germany
3                      Mexico
4    United States of America
Name: Country, dtype: object

In [93]:
sbc.Country = sbc.Country.replace("United States of America","USA")

In [94]:
sbc

   Country         Sales
0   Canada  2.400017e+07
1   France  2.711725e+07
2  Germany  2.290578e+07
3   Mexico  2.084595e+07
4      USA  2.385720e+07